Revit 2024 API
RebarBendingDetailType.AngularDimensionsForHooksEnabled Property
 Identifies if the angular dimensions which has a reference set on a hook will be shown or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool AngularDimensionsForHooksEnabled { get; set; }
Visual Basic
Public Property AngularDimensionsForHooksEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool AngularDimensionsForHooksEnabled {
	bool get ();
	void set (bool value);
}
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace